In [233]:
import pandas as pd
import numpy as np

In [234]:
df_pitch = pd.read_excel("Pitchfinder DB.xlsx", usecols = "C, P")

In [235]:
df_schools = pd.read_excel("Schools.xlsx", usecols = "E, AU")

In [236]:
df_pools = pd.read_excel("Pools.xlsx", usecols = "A,E")

In [237]:
df_schools.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29925 entries, 0 to 29924
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   EstablishmentName  29925 non-null  object
 1   Postcode           29751 non-null  object
dtypes: object(2)
memory usage: 467.7+ KB

In [238]:
df_pitch['name'] = df_pitch['name'].apply(lambda x: x.lower())
df_pitch['name'] = df_pitch['name'].apply(lambda x: x.replace("'", ""))
df_pitch['name'] = df_pitch['name'].apply(lambda x: x.replace(".", " "))

df_pools['Name'] = df_pools['Name'].apply(lambda x: x.lower())
df_pools['Name'] = df_pools['Name'].apply(lambda x: x.replace("'", ""))
df_pools['Name'] = df_pools['Name'].apply(lambda x: x.replace(".", " "))

df_schools['EstablishmentName'] = df_schools['EstablishmentName'].apply(lambda x: x.lower())
df_schools['EstablishmentName'] = df_schools['EstablishmentName'].apply(lambda x: x.replace("'", ""))
df_schools['EstablishmentName'] = df_schools['EstablishmentName'].apply(lambda x: x.replace(".", " "))

In [239]:
df_pitch["name2"] = df_pitch["name"].apply(lambda x: x.split()[0])
df_pitch["name2"] = df_pitch["name2"].apply(lambda x: "st" if x == "saint" else x)

df_pools["Name2"] = df_pools["Name"].apply(lambda x: x.split()[0])
df_pools["Name2"] = df_pools["Name2"].apply(lambda x: "st" if x == "saint" else x)


df_schools["EstablishmentName2"] = df_schools["EstablishmentName"].apply(lambda x: x.split()[0])
df_schools["EstablishmentName2"] = df_schools["EstablishmentName2"].apply(lambda x: "st" if x == "saint" else x)

In [240]:
df_master = df_schools.merge(df_pitch, how = "left", left_on = ["Postcode", "EstablishmentName2"], right_on = ["postcode", "name2"])

In [241]:
df_final = df_master.merge(df_pools,  how = "left", left_on = ["Postcode", "EstablishmentName2"], right_on = ["Post Code", "Name2"])

In [242]:
df_final.head()

,EstablishmentName,Postcode,EstablishmentName2,name,postcode,name2,Name,Post Code,Name2
0,the starship childrens centre,CB23 8DY,the,NaN,NaN,NaN,NaN,NaN,NaN
1,carlisle south petteril bank upperby surestart...,CA1 3BX,carlisle,NaN,NaN,NaN,NaN,NaN,NaN
2,central sure start childrens centre,SO14 0AU,central,NaN,NaN,NaN,NaN,NaN,NaN
3,ryde childrens centre,PO33 2JF,ryde,NaN,NaN,NaN,NaN,NaN,NaN
4,west allerdale surestart childrens centre,CA15 8HN,west,NaN,NaN,NaN,NaN,NaN,NaN

In [245]:
df_final.drop(columns = ["EstablishmentName2", "postcode", "name2", "Post Code", "Name2"], inplace = True)

In [247]:
df_final.rename(columns = {"name":"Pitchfinder_name", "Name":"Pool_name"}, inplace = True)

In [258]:
df_final.sample(10)

,EstablishmentName,Postcode,Pitchfinder_name,Pool_name
26209,"parish church of england primary school, st he...",WA10 1LW,NaN,NaN
22600,knowl hill church of england primary academy,RG10 9UX,NaN,NaN
20533,broom leys school,LE67 4DB,broom leys primary school,NaN
28225,broadwater school,GU7 3BW,broadwater school,NaN
17543,kingslea primary school,RH13 5PS,kingslea primary school,NaN
21560,iqra academy,BD8 8DA,NaN,NaN
30029,dewstow primary school,NP26 4HD,NaN,NaN
18440,kendrick school,RG1 5BN,NaN,kendrick girls grammar school
13667,eskdale school,YO22 4HS,eskdale school,NaN
22986,castle primary school,ST7 4NE,castle primary school,NaN

In [230]:
df_final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30164 entries, 0 to 30163
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   EstablishmentName  30164 non-null  object
 1   Postcode           29990 non-null  object
dtypes: object(2)
memory usage: 707.0+ KB

In [231]:
df_final.to_excel("final.xlsx")